[
    {
        "_id": "M101",
        "name": "Week 0 - INTRODUCTION TO DATA SCIENCE FUNDAMENTALS",
        "description": "Students will be introduced to the basics of data analysis, the role of statistics in data science",
        "course": "CS101",
        "lessons": [
            {
                "_id": "L101",
                "name": "LEARNING OBJECTIVES",
                "description": "Introduction to the basics of Data Science, including data analysis, statistics, and machine learning.",
                "module": "M101",
                "indent": 2
            },
            {
                "_id": "L102",
                "name": "Introduction to Data Analysis",
                "description": "Understanding data analysis techniques and tools for interpreting data.",
                "module": "M101",
                "indent": 5
            },
            {
                "_id": "L103",
                "name": "Statistics for Data Science",
                "description": "Foundational statistics concepts essential for data science.",
                "module": "M101",
                "indent": 5
            },
            {
                "_id": "L104",
                "name": "Machine Learning Basics",
                "description": "Basic principles and types of machine learning algorithms.",
                "module": "M101",
                "indent": 5
            },
            {
                "_id": "L105",
                "name": "Data Visualization Techniques",
                "description": "Techniques and tools for visualizing and interpreting data.",
                "module": "M101",
                "indent": 5
            }
        ]
        
    },
    {
        "_id": "M102",
        "name": "WEEK 1 - ADVANCED DATA ANALYSIS AND PREDICTIVE MODELING",
        "description": "The second week delves into advanced topics in data science",
        "course": "CS101",
        "lessons": [
            {
                "_id": "L201",
                "name": "LEARNING OBJECTIVES",
                "description": "Introduction to advanced data analysis techniques and predictive modeling.",
                "module": "M102",
                "indent": 2
            },
            {
                "_id": "L202",
                "name": "Data Preprocessing",
                "description": "Techniques for cleaning, transforming, and preparing data for analysis.",
                "module": "M102",
                "indent": 5
            },
            {
                "_id": "L203",
                "name": "Predictive Modeling",
                "description": "Introduction to building predictive models using various machine learning algorithms.",
                "module": "M102",
                "indent": 5
            },
            {
                "_id": "L204",
                "name": "Evaluation of Models",
                "description": "Methods for evaluating and selecting the best model for data predictions.",
                "module": "M102",
                "indent": 5
            }
        ]
        
    },
    {
        "_id": "M103",
        "name": "WEEK 2 - SPECIALIZED TOPICS IN DATA SCIENCE",
        "description": "Principles of rocket nozzle design and performance optimization.",
        "course": "CS101",
        "lessons": [
            {
                "_id": "L301",
                "name": "LEARNING OBJECTIVES",
                "description": "Exploring advanced machine learning techniques and their applications in real-world problems.",
                "module": "M103",
                "indent": 2
            },
            {
                "_id": "L302",
                "name": "Time Series Analysis",
                "description": "Introduction to time series analysis and forecasting techniques.",
                "module": "M103",
                "indent": 5
            },
            {
                "_id": "L303",
                "name": "Natural Language Processing",
                "description": "Understanding the basics of natural language processing and its applications.",
                "module": "M103",
                "indent": 5
            },
            {
                "_id": "L304",
                "name": "Deep Learning",
                "description": "Exploring the fundamentals of deep learning and neural networks.",
                "module": "M103",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M201",
        "name": "Week 0 - Fundamentals of Machine Learning",
        "description": "This module introduces the fundamentals of machine learning, covering key concepts, algorithms, and practical applications. Students will learn about supervised and unsupervised learning, model evaluation, and the process of training and testing machine learning models. The module aims to provide a strong foundation in machine learning, enabling students to understand and apply basic techniques to real-world problems.",
        "course": "CS102",
        "lessons": [
            {
                "_id": "L201",
                "name": "Introduction to Machine Learning",
                "description": "Overview of machine learning, its significance, and real-world applications.",
                "module": "M201",
                "indent": 2
            },
            {
                "_id": "L202",
                "name": "Supervised vs Unsupervised Learning",
                "description": "Distinguishing between supervised and unsupervised learning, including examples and use cases.",
                "module": "M201",
                "indent": 5
            },
            {
                "_id": "L203",
                "name": "Data Preprocessing",
                "description": "Techniques for cleaning and preparing data for machine learning models.",
                "module": "M201",
                "indent": 5
            },
            {
                "_id": "L204",
                "name": "Introduction to Linear Regression",
                "description": "Basic concepts of linear regression, including model fitting and prediction.",
                "module": "M201",
                "indent": 5
            },
            {
                "_id": "L205",
                "name": "Model Evaluation",
                "description": "Techniques for evaluating the performance of machine learning models.",
                "module": "M201",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M202",
        "name": "Week 1 - Advanced Machine Learning Techniques",
        "description": "This module delves into advanced machine learning techniques, exploring complex algorithms, model optimization, and techniques for handling high-dimensional data. Students will learn about decision trees, ensemble methods, support vector machines, and neural networks. The module also covers strategies for improving model performance and avoiding common pitfalls in machine learning.",
        "course": "CS102",
        "lessons": [
            {
                "_id": "L206",
                "name": "Decision Trees and Random Forests",
                "description": "Exploring the concepts and applications of decision trees and random forests in machine learning.",
                "module": "M202",
                "indent": 2
            },
            {
                "_id": "L207",
                "name": "Ensemble Methods",
                "description": "Introduction to ensemble learning methods and their effectiveness in improving predictions.",
                "module": "M202",
                "indent": 5
            },
            {
                "_id": "L208",
                "name": "Support Vector Machines",
                "description": "Understanding the theory and application of support vector machines in classification problems.",
                "module": "M202",
                "indent": 5
            },
            {
                "_id": "L209",
                "name": "Introduction to Neural Networks",
                "description": "Basics of neural networks, including architecture, training, and applications.",
                "module": "M202",
                "indent": 5
            },
            {
                "_id": "L210",
                "name": "Model Optimization and Tuning",
                "description": "Techniques for optimizing and tuning machine learning models to enhance performance.",
                "module": "M202",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M203",
        "name": "Week 2 - Deep Learning and Its Applications",
        "description": "This module introduces deep learning, a subset of machine learning that uses neural networks with many layers. Students will explore the fundamentals of deep learning, including various architectures like convolutional neural networks (CNNs) and recurrent neural networks (RNNs), and their applications in image recognition, natural language processing, and more. The module aims to provide an in-depth understanding of deep learning techniques and how they can be applied to solve complex real-world problems.",
        "course": "CS102",
        "lessons": [
            {
                "_id": "L211",
                "name": "Introduction to Deep Learning",
                "description": "Overview of deep learning and the key concepts of neural networks.",
                "module": "M203",
                "indent": 2
            },
            {
                "_id": "L212",
                "name": "Convolutional Neural Networks (CNNs)",
                "description": "Exploring CNNs and their applications in image and video recognition.",
                "module": "M203",
                "indent": 5
            },
            {
                "_id": "L213",
                "name": "Recurrent Neural Networks (RNNs)",
                "description": "Understanding RNNs and their use in sequence analysis and natural language processing.",
                "module": "M203",
                "indent": 5
            },
            {
                "_id": "L214",
                "name": "Practical Applications of Deep Learning",
                "description": "Case studies on deep learning applications in various fields such as healthcare, autonomous vehicles, and finance.",
                "module": "M203",
                "indent": 5
            },
            {
                "_id": "L215",
                "name": "Ethics and Future of Deep Learning",
                "description": "Discussion on the ethical considerations and the future impact of deep learning technologies.",
                "module": "M203",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M301",
        "name": "WEEK 0 - INTRODUCTION TO DEEP LEARNING",
        "description": "Fundamentals of designing spacecraft structures and materials selection.",
        "course": "CS103",
        "lessons": [
            {
                "_id": "L301",
                "name": "Deep Learning Overview",
                "description": "Introduction to deep learning, its history, and impact on technology and society.",
                "module": "M301",
                "indent": 2
            },
            {
                "_id": "L302",
                "name": "Neural Networks Basics",
                "description": "Fundamentals of neural networks, including neurons, layers, and architectures.",
                "module": "M301",
                "indent": 5
            },
            {
                "_id": "L303",
                "name": "Activation Functions and Layers",
                "description": "Exploring the role of activation functions and the different types of layers in a neural network.",
                "module": "M301",
                "indent": 5
            },
            {
                "_id": "L304",
                "name": "Backpropagation and Training",
                "description": "Understanding the backpropagation algorithm and training processes for deep learning models.",
                "module": "M301",
                "indent": 5
            },
            {
                "_id": "L305",
                "name": "Introduction to TensorFlow and PyTorch",
                "description": "Getting started with TensorFlow and PyTorch, the leading libraries for deep learning.",
                "module": "M301",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M302",
        "name": "WEEK 1 - DEEP LEARNING MODELS AND APPLICATIONS",
        "description": "This module delves deeper into specific deep learning models and their wide-ranging applications across various fields. Students will explore convolutional neural networks (CNNs) for image processing, recurrent neural networks (RNNs) for time series analysis, and the basics of generative adversarial networks (GANs). The module aims to provide practical insights into building, training, and deploying deep learning models to solve real-world problems.",
        "course": "CS103",
        "lessons": [
            {
                "_id": "L306",
                "name": "Convolutional Neural Networks (CNNs)",
                "description": "Detailed exploration of CNNs, their architecture, and applications in image and video recognition.",
                "module": "M302",
                "indent": 2
            },
            {
                "_id": "L307",
                "name": "Recurrent Neural Networks (RNNs)",
                "description": "Understanding RNNs, including LSTM and GRU, and their applications in sequence data analysis.",
                "module": "M302",
                "indent": 5
            },
            {
                "_id": "L308",
                "name": "Generative Adversarial Networks (GANs)",
                "description": "Introduction to GANs, their structure, and use cases in generating new data.",
                "module": "M302",
                "indent": 5
            },
            {
                "_id": "L309",
                "name": "Deep Learning for Natural Language Processing (NLP)",
                "description": "Applying deep learning models to understand and generate human language.",
                "module": "M302",
                "indent": 5
            },
            {
                "_id": "L310",
                "name": "Real-World Applications of Deep Learning",
                "description": "Case studies highlighting the impact of deep learning in healthcare, autonomous vehicles, and other sectors.",
                "module": "M302",
                "indent": 5
            }
        ]
    },
    {
        "_id": "M303",
        "name": "WEEK 2 - ADVANCED TOPICS IN DEEP LEARNING",
        "description": "This module covers advanced topics in deep learning, including optimization techniques for training deep networks, advanced neural network architectures, and an exploration of cutting-edge research in the field. Students will learn about techniques to improve the efficiency and performance of deep learning models, explore transformer models and their impact on natural language processing, and gain insights into the future directions of deep learning research.",
        "course": "CS103",
        "lessons": [
            {
                "_id": "L311",
                "name": "Optimization Techniques in Deep Learning",
                "description": "Exploring various optimization algorithms and techniques used to train deep neural networks effectively.",
                "module": "M303",
                "indent": 2
            },
            {
                "_id": "L312",
                "name": "Advanced Neural Network Architectures",
                "description": "Detailed study of advanced architectures, including attention mechanisms and transformers.",
                "module": "M303",
                "indent": 5
            },
            {
                "_id": "L313",
                "name": "Autoencoders and Variational Autoencoders",
                "description": "Understanding the principles of autoencoders and variational autoencoders for unsupervised learning.",
                "module": "M303",
                "indent": 5
            },
            {
                "_id": "L314",
                "name": "Deep Reinforcement Learning",
                "description": "Introduction to reinforcement learning concepts and their application in deep learning.",
                "module": "M303",
                "indent": 5
            },
            {
                "_id": "L315",
                "name": "Current Trends and Research in Deep Learning",
                "description": "Discussion on the latest research, trends, and future directions in deep learning.",
                "module": "M303",
                "indent": 5
            }
        ]
    }
]